MarcoSuma76/sample_projectweb_interface/components/Esp32_WebInterface/Esp32_WebInterface_server_func.c
/*
  Esp32_WebInterface_server_func.c
*/

#include "Esp32_WebInterface.h"
#include "esp_log.h"
#include "esp_wifi.h"  // Per esp_wifi_scan_start, wifi_ap_record_t, ecc.
#include "esp_event.h" // Necessario per la gestione degli eventi wifi
#include "esp_ota_ops.h"
#include "esp_flash_partitions.h"
#include "esp_partition.h"
#include <sys/param.h> //per il MIN usato nell'OTA

#include "index_html.h" // Questo includerà la stringa generata dal Python

// Tag per il log
static const char *TAG = "WEB_SERVER";

// --- FUNZIONI DI SUPPORTO

// --- getValue restituisce il valore della variabile puntata come stringa, pronto per essere inviato al web
const char *WebInterface_getValue(WebInterface_t *self, int indice)
{
    Oggetto_t *obj = &self->oggetti[indice];

    // --- CASO 1: PUNTATORI A STRINGA (Char, Char_Set, Debug) ---
    if (obj->Pchar != NULL)
    {
        if (obj->Pchar[0] == '\0')
            return "-!x";

        // Se è un normale "char" o "string", facciamo una pulizia veloce dei pipe
        // solo se necessario, per non rompere il protocollo.
        // Se il log/stringa è molto lungo, questo ciclo è veloce su ESP32.
        for (int i = 0; obj->Pchar[i] != '\0'; i++)
        {
            if (obj->Pchar[i] == '|')
                obj->Pchar[i] = '-';
        }

        return obj->Pchar; // Restituisce direttamente la RAM del main.c
    }

    // --- CASO 2: VALORI NUMERICI / BOOL ---
    // Questi vengono convertiti nel piccolo buffer obj->value (32 byte)
    if (strstr(obj->tipo, "bool"))
        WebInterface_ValueFromProgramByPbool(self, indice);
    else if (strstr(obj->tipo, "int") || strstr(obj->tipo, "count"))
        WebInterface_ValueFromProgramByPint(self, indice);
    else if (strstr(obj->tipo, "float"))
        WebInterface_ValueFromProgramByPfloat(self, indice);

    return obj->value;
}

// --- setValue setta il valore ricevuto in formato char dal web alla variabile puntata (se char)
// o se è int/float/bool  aggiorna e il buffer .value dell'oggetto e poi
// chiama la funzione di conversione per aggiornare la variabile puntata
void WebInterface_setValue(WebInterface_t *self, int indice, const char *_value)
{
    if (self == NULL || indice < 0 || indice >= self->num_oggetti)
        return;

    const char *tipo = self->oggetti[indice].tipo;
    char valore_validato[32];
    const char *p_final_value = _value;

    // --- 1. VALIDAZIONE RANGE PER NUMERICI (INT e FLOAT) ---
    if (strstr(tipo, "int") || strstr(tipo, "count") || strstr(tipo, "float"))
    {
        float val = atof(_value); // Converte in float per il controllo universale
        bool corretto = false;

        if (val < self->oggetti[indice].min)
        {
            val = self->oggetti[indice].min;
            corretto = true;
        }
        if (val > self->oggetti[indice].max)
        {
            val = self->oggetti[indice].max;
            corretto = true;
        }

        // Se abbiamo dovuto correggere il valore, generiamo una nuova stringa pulita
        if (corretto)
        {
            if (strstr(tipo, "float"))
                snprintf(valore_validato, sizeof(valore_validato), "%.2f", val);
            else
                snprintf(valore_validato, sizeof(valore_validato), "%d", (int)val);

            p_final_value = valore_validato;
        }
    }

    // --- 2. GESTIONE STRINGHE (Pchar diretto) ---
    if (strstr(tipo, "char"))
    {
        WebInterface_ValueFromWebByPchar(self, indice, p_final_value);
    }
    // --- 3. GESTIONE NUMERICI/BOOL (Usa .value come appoggio) ---
    else
    {
        // Copiamo il valore validato nel buffer interno dell'oggetto
        strncpy(self->oggetti[indice].value, p_final_value, sizeof(self->oggetti[indice].value) - 1);
        self->oggetti[indice].value[sizeof(self->oggetti[indice].value) - 1] = '\0';

        if (strstr(tipo, "bool"))
            WebInterface_ValueFromWebByPbool(self, indice);
        else if (strstr(tipo, "int") || strstr(tipo, "count"))
            WebInterface_ValueFromWebByPint(self, indice);
        else if (strstr(tipo, "float"))
            WebInterface_ValueFromWebByPfloat(self, indice);
        else if (strcmp(tipo, "button") == 0)
            WebInterface_exeFunzione(self, indice);
    }

    // --- 4. AGGIUNTA PER AUTOMAZIONE HA ---
    // Pubblichiamo subito il cambio su HA (se il valore è stato corretto, HA riceverà quello giusto)
    if (self->HA_Set && self->oggetti[indice].HA && self->mqtt_client != NULL)
    {
        WebInterface_publishState(self, indice);
    }
}
// --- HANDLER DEGLI URI (Standard ESP-IDF) ---

// Funzione di utilità per decodificare URL-encoded strings (es. spazi, caratteri speciali)
void url_decode(char *src)
{
    char *dst = src;
    while (*src)
    {
        if (*src == '%' && src[1] && src[2])
        {
            int value;
            if (sscanf(src + 1, "%02x", &value) == 1)
            {
                *dst++ = (char)value;
                src += 3;
            }
            else
            {
                *dst++ = *src++;
            }
        }
        else if (*src == '+')
        {
            *dst++ = ' ';
            src++;
        }
        else
        {
            *dst++ = *src++;
        }
    }
    *dst = '\0';
}

// 1. Pagina Principale (/) carica index.html(l'interfaccia)
static esp_err_t index_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_send(req, index_html, HTTPD_RESP_USE_STRLEN);
}

// 2. getOggettiWeb (Configurazione iniziale)
// viene chiamata dal client all'apertura dell'intervaccia e invia tutti gli oggetti legati alle variabili locali da creare sulla pagina
static esp_err_t getOggettiWeb_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;

    // --- LOGICA DIAGNOSTICA WI-FI (Originale) ---
    // Questa parte è stata mantenuta per fornire un feedback immediato sullo stato della connessione Wi-Fi all'apertura dell'interfaccia.
    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK)
    {
        char info_wifi[100];
        esp_netif_ip_info_t ip_info;
        esp_netif_t *netif = esp_netif_get_default_netif();
        // Se siamo connessi e abbiamo un IP valido, mostriamo anche l'indirizzo IP. Altrimenti, indichiamo che non abbiamo un IP.
        if (netif != NULL && esp_netif_get_ip_info(netif, &ip_info) == ESP_OK)
        {
            char ip_str[16];
            esp_ip4addr_ntoa(&ip_info.ip, ip_str, sizeof(ip_str));

