MarcoSuma76/sample_projectweb_interface/components/Esp32_WebInterface/Esp32_WebInterface_server_func.c
            // ABBIAMO TOLTO IL CARATTERE '|' PER NON ROMPERE IL PARSING
            snprintf(info_wifi, sizeof(info_wifi), "Rete: %s -- IP: %s",
                     (char *)ap_info.ssid, ip_str);
        }
        else
        {
            snprintf(info_wifi, sizeof(info_wifi), "Rete: %s -- IP: 0.0.0.0", (char *)ap_info.ssid);
        }

        WebInterface_Log(self, "STATUS", info_wifi);
    }
    else
    {
        WebInterface_Log(self, "STATUS", "Wi-Fi non connesso o in modalità AP");
    }

    // --- COSTRUZIONE PACCHETTO AGGIORNATO ---
    // Aumentiamo leggermente il buffer se hai molti oggetti con etichette lunghe
    char *pacchetto = malloc(8192);
    if (pacchetto == NULL)
        return ESP_FAIL;
    pacchetto[0] = '\0';

    char riga[256]; // Buffer temporaneo per ogni oggetto

    // --- AGGIUNTA: INVIO DATI MQTT ---
    // Inviamo i dati nel formato tipo:nome:etichetta=host,porta,user,pw|
    snprintf(riga, sizeof(riga), "mqttconfig:broker:config=%s,%d,%s,%s|",
             self->mqtt_server,
             self->mqtt_port,
             self->mqtt_user,
             self->mqtt_pw);
    strcat(pacchetto, riga);
    // Il client JS userà queste info per precompilare i campi di configurazione MQTT
    for (int a = 0; a < self->num_oggetti; a++)
    {
        /* NUOVO FORMATO: tipo,nome,etichetta=valore|
           In questo modo il JS riceve 3 metadati (tipo, nome tecnico, etichetta)
           e il valore separato dall'uguale.
        */
        // Usiamo il formato tipo : nome : etichetta = valore |
        // I due punti sono separatori molto più stabili della virgola
        snprintf(riga, sizeof(riga), "%s:%s:%s=%s|",
                 self->oggetti[a].tipo,
                 self->oggetti[a].nome,
                 self->oggetti[a].etichetta,
                 WebInterface_getValue(self, a));

        strcat(pacchetto, riga);
    }

    httpd_resp_set_type(req, "text/plain");
    esp_err_t res = httpd_resp_send(req, pacchetto, HTTPD_RESP_USE_STRLEN);

    free(pacchetto);
    return res;
}

// 3. getDati (Aggiornamento valori - Chiamata ogni secondo via AJAX)
// viene chiamata dal client ogni secondo e invia i valori legati alle variabili locali
static esp_err_t getDati_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx; // Recuperiamo il contesto passato durante la registrazione dell'handler

    // Allocazione buffer
    char *pacchetto = malloc(3000);
    if (pacchetto == NULL)
        return ESP_FAIL;
    pacchetto[0] = '\0';
    // Ciclo su tutti gli oggetti registrati per costruire il pacchetto di risposta
    for (int a = 0; a < self->num_oggetti; a++)
    {
        // --- 1. GESTIONE SYSTEM-LOG ---
        if (strcmp(self->oggetti[a].tipo, "system-log") == 0)
        {
            strcat(pacchetto, "system_log=");
            if (self->system_log[0] != '\0' && strcmp(self->system_log, "-!x") != 0)
            {
                strcat(pacchetto, self->system_log);
                strcpy(self->system_log, "-!x");
            }
            else
            {
                strcat(pacchetto, "-!x");
            }
            strcat(pacchetto, "|");
        }
        // --- 2. TUTTI GLI ALTRI OGGETTI ---
        else
        {
            const char *val = WebInterface_getValue(self, a);

            // 1. Aggiungiamo il valore al pacchetto che andrà al browser
            strcat(pacchetto, self->oggetti[a].nome);
            strcat(pacchetto, "=");
            strcat(pacchetto, val);
            strcat(pacchetto, "|");

            // LOGICA DI CONSUMO SOLO PER DEBUG
            // Se è un debug, lo azzeriamo dopo averlo copiato nel pacchetto
            if (strcmp(self->oggetti[a].tipo, "debug") == 0)
            {
                if (self->oggetti[a].Pchar != NULL)
                {
                    self->oggetti[a].Pchar[0] = '\0';
                }
            }
            // Se è un 'char' normale, NON entriamo qui e la stringa resta nel main.c
        }
    } // <-- Fine del ciclo FOR

    // 1. Aggiungiamo il valore per rss
    int rssi = 0;
    wifi_ap_record_t ap;
    if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK)
    {
        rssi = ap.rssi; // Ottiene il valore in dBm (es. -65)
    }
    char rssi_str[10];
    snprintf(rssi_str, sizeof(rssi_str), "%d", rssi);
    strcat(pacchetto, "wifi_rssi=");
    strcat(pacchetto, rssi_str);
    strcat(pacchetto, "|");

    // 2. Aggiungiamo lo stato MQTT (1 o 0) al pacchetto
    bool mqtt_conn = (self->mqtt_connected); // La tua variabile di stato MQTT
    strcat(pacchetto, "mqtt_status=");
    strcat(pacchetto, mqtt_conn ? "1" : "0");
    strcat(pacchetto, "|");

    // Aggiungi anche lo stato dell'abilitazione (se il servizio deve essere attivo)
    strcat(pacchetto, "mqtt_en=");
    strcat(pacchetto, self->mqtt_connected ? "1" : "0");
    strcat(pacchetto, "|");

    httpd_resp_set_type(req, "text/plain");
    esp_err_t res = httpd_resp_send(req, pacchetto, HTTPD_RESP_USE_STRLEN);

    free(pacchetto);
    return res;
}

// 4. putDati?nome=valore
// viene chiamata dal client quando un utente ,modifica il valore sull'oggetto web legato alla variabile locale
static esp_err_t putDati_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;

    // Allocazione dinamica del buffer in base alla lunghezza del contenuto ricevuto
    // Aggiungiamo +1 per il terminatore null
    size_t size = req->content_len + 1;
    char *buf = malloc(size);
    if (buf == NULL)
        return ESP_FAIL;

    int ret = httpd_req_recv(req, buf, req->content_len);
    if (ret <= 0)
    {
        free(buf);
        return ESP_FAIL;
    }
    buf[ret] = '\0';

    // Parsing della stringa "chiave=valore"
    char *key = strtok(buf, "=");
    char *value = strtok(NULL, "=");

    if (key && value)
    {
        for (int a = 0; a < self->num_oggetti; a++)
        {
            if (strcmp(self->oggetti[a].nome, key) == 0)
            {
                // Scrivo il valore direttamente (Zero-Copy per le stringhe)
                WebInterface_setValue(self, a, value);

                // Aggiornamento per la risposta (opzionale se usi Pchar diretto)
                WebInterface_getValue(self, a);

                ESP_LOGI("SERVER", "Update: %s , valore: %s", key, value);
                break;
            }
        }
    }

    free(buf); // Fondamentale liberare la memoria!
    return httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
}

// 5,6,7. Comandi di sistema (Reset, Memorizza, Azzera)
// viene chiamata dal client quando un utente ,preme uno dei tasti funzione
static esp_err_t system_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;

