MarcoSuma76/sample_projectweb_interface/components/Esp32_WebInterface/Esp32_WebInterface_server_func.c
    if (strcmp(req->uri, "/memorizzaDati") == 0)
    {
        WebInterface_memorizzaDati(self);
        httpd_resp_sendstr(req, "Dati salvati correttamente in NVS.");
        WebInterface_Log(self, TAG, "Dati salvati su richiesta web.");
    }
    else if (strcmp(req->uri, "/azzeraDati") == 0)
    {
        // RISPOSTA IMMEDIATA: evita che il browser ricarichi all'infinito
        httpd_resp_sendstr(req, "OK: Azzeramento e riavvio in corso...");
        // PAUSA: tempo tecnico per inviare il pacchetto HTTP sulla rete
        vTaskDelay(pdMS_TO_TICKS(1000));
        // ESECUZIONE
        WebInterface_azzeraDati(self);
    }
    else if (strcmp(req->uri, "/resetEsp32") == 0)
    {
        httpd_resp_sendstr(req, "OK: Riavvio in corso...");
        ESP_LOGW(TAG, "Riavvio hardware richiesto.");
        vTaskDelay(pdMS_TO_TICKS(1500));
        esp_restart();
    }

    return ESP_OK;
}

// 8. Scan WiFi - Avvia la scansione, genera un JSON e lo invia al browser
// viene chiamata dal client quando un utente apre la pagina di configurazione WiFi
static esp_err_t scanWiFi_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;
    uint16_t max_entries = 10;
    wifi_ap_record_t ap_info[10];
    uint16_t ap_count = 0;

    // CHIAMATA ALLA FUNZIONE ESTERNA
    esp_err_t err = WebInterface_WiFi_GetScanResults(ap_info, &ap_count, max_entries);

    if (err != ESP_OK)
    {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    // --- COSTRUZIONE DEL JSON (Logica Server) ---
    char *json_response = malloc(1024);
    if (json_response == NULL)
        return ESP_ERR_NO_MEM;

    strcpy(json_response, "[");
    for (int i = 0; i < ap_count; i++)
    {
        char entry[128];
        snprintf(entry, sizeof(entry),
                 "{\"ssid\":\"%s\",\"rssi\":%d}%s",
                 (char *)ap_info[i].ssid, ap_info[i].rssi,
                 (i == ap_count - 1) ? "" : ",");
        strcat(json_response, entry);
    }
    strcat(json_response, "]");

    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, json_response);

    free(json_response);
    WebInterface_Log(self, TAG, "Reti scansionate: %d", ap_count);
    return ESP_OK;
}

// 9. Setup WiFi - Riceve SSID e Password
// viene chiamata dal client quando un utente ,inserisce ssid e password e preme connetti e poi viene eseguita la connessione alla rete WiFi
static esp_err_t setupWiFi_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx; // Recuperiamo il contesto
    char buf[256];
    int ret = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (ret <= 0)
    {
        if (ret == HTTPD_SOCK_ERR_TIMEOUT)
        {
            httpd_resp_send_408(req);
        }
        return ESP_FAIL;
    }
    buf[ret] = '\0';

    char *ssid = NULL;
    char *pass = NULL;

    // Estrazione parametri (Parsing semplice)
    char *p = strtok(buf, "&");
    while (p != NULL)
    {
        if (strncmp(p, "ssid=", 5) == 0)
            ssid = p + 5;
        if (strncmp(p, "pass=", 5) == 0)
            pass = p + 5;
        p = strtok(NULL, "&");
    }

    if (ssid != NULL && pass != NULL)
    {
        // Applichiamo la decodifica per gestire spazi e caratteri speciali
        url_decode(ssid);
        url_decode(pass);

        ESP_LOGI("WIFI_SETUP", "SSID Ricevuto: %s", ssid);
        ESP_LOGI("WIFI_SETUP", "Pass Ricevuta: %s", pass);

        // 1. Invia prima la risposta al browser (così l'utente vede il messaggio)
        // Prepariamo un messaggio pulito per l'alert
        char resp_msg[128];
        snprintf(resp_msg, sizeof(resp_msg),
                 "Ricevuto! L'ESP32 sta tentando la connessione a: %s. Verificare i log o il nuovo IP.",
                 ssid);

        // Invio come plain text
        httpd_resp_set_type(req, "text/plain");
        httpd_resp_sendstr(req, resp_msg);

        // 2. Attendi un brevissimo istante per assicurarti che il pacchetto TCP parta
        vTaskDelay(pdMS_TO_TICKS(500));

        // 3. Salva e avvia la connessione (usando la tua funzione nel file .c)
        WebInterface_WiFi_SaveConfig(self, ssid, pass);
    }
    else
    {
        // CORREZIONE QUI: Usiamo la funzione corretta per l'errore 400
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "SSID o Password mancanti");
    }
    return ESP_OK;
}

// 10. Reset WiFi e riavvio
// viene chiamata dal client quando un utente ,preme il tasto per cancellare i dati WiFi e riavviare l'ESP32
static esp_err_t clearWiFi_handler(httpd_req_t *req)
{
    ESP_LOGW(TAG, "Richiesta cancellazione totale WiFi ricevuta dal Web");

    // Rispondiamo al browser
    httpd_resp_sendstr(req, "Memoria cancellata. Riavvio in corso...\n\n"
                            "Passero' allo stato AP\n"
                            "SSID: ESP32_Dashboard\n"
                            "IP: 192.168.4.1");

    // Chiamiamo la funzione di cancellazione
    WebInterface_WiFi_ClearConfig();

    // Attendiamo un attimo e resettiamo
    vTaskDelay(pdMS_TO_TICKS(2000));
    esp_restart();

    return ESP_OK;
}

// 11 OTA
//  viene chiamata dal client quando un utente ,carica un nuovo firmware tramite la pagina di aggiornamento OTA
esp_err_t ota_update_post_handler(httpd_req_t *req)
{
    char buf[1024];
    esp_ota_handle_t update_handle = 0;
    const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;

    if (update_partition == NULL)
    {
        WebInterface_Log(self, "OTA", "Errore: Partizione OTA non trovata! Controlla partitions.csv");
        return ESP_FAIL;
    }

    WebInterface_Log(self, "OTA", "Inizio ricezione firmware...");

    esp_err_t err = esp_ota_begin(update_partition, OTA_SIZE_UNKNOWN, &update_handle);
    if (err != ESP_OK)
    {
        WebInterface_Log(self, "OTA", "Errore inizio OTA (0x%X)", err);
        return ESP_FAIL;
    }

    int remaining = req->content_len;
    bool is_first_chunk = true;

