MarcoSuma76/sample_projectweb_interface/components/Esp32_WebInterface/Esp32_WebInterface_server_func.c
    while (remaining > 0)
    {
        int recv_len = httpd_req_recv(req, buf, MIN(remaining, sizeof(buf)));
        if (recv_len <= 0)
        {
            if (recv_len == HTTPD_SOCK_ERR_TIMEOUT)
                continue;
            esp_ota_end(update_handle);
            return ESP_FAIL;
        }

        // --- PROTEZIONE: Controllo Header ---
        if (is_first_chunk)
        {
            // Un firmware ESP32 valido inizia sempre con il byte 0xE9
            if (buf[0] != 0xE9)
            {
                WebInterface_Log(self, "OTA", "Errore: Il file non è un firmware ESP32 valido!");
                esp_ota_abort(update_handle);
                httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File non valido");
                return ESP_FAIL;
            }
            is_first_chunk = false;
        }
        // -------------------------------------

        esp_ota_write(update_handle, buf, recv_len);
        remaining -= recv_len;
    }

    if (esp_ota_end(update_handle) != ESP_OK || esp_ota_set_boot_partition(update_partition) != ESP_OK)
    {
        WebInterface_Log(self, "OTA", "Errore validazione firmware!");
        return ESP_FAIL;
    }

    WebInterface_Log(self, "OTA", "Aggiornamento riuscito! Riavvio...");
    httpd_resp_sendstr(req, "OK");

    vTaskDelay(pdMS_TO_TICKS(2000));
    esp_restart();
    return ESP_OK;
}

// 12. Reset Singolo - Riceve il nome di una variabile e la resetta al valore di default
// viene chiamata dal client quando un utente ,preme il tasto di reset accanto ad ogni variabile
// per riportarla al valore di default definito nel codice
static esp_err_t resetSingolo_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;
    char buf[128];
    memset(buf, 0, sizeof(buf));

    int ret = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (ret <= 0)
        return ESP_FAIL;
    buf[ret] = '\0';

    // 1. Parsing più robusto
    char *nome_var = NULL;
    char *p = strstr(buf, "nome="); // Cerchiamo esplicitamente la chiave
    if (p)
    {
        nome_var = p + 5; // Saltiamo "nome="
    }
    else
    {
        nome_var = strchr(buf, '='); // Fallback sul vecchio metodo se non c'è "nome="
        if (nome_var)
            nome_var++;
    }

    if (nome_var)
    {
        for (int a = 0; a < self->num_oggetti; a++)
        {
            if (strcmp(self->oggetti[a].nome, nome_var) == 0)
            {
                // 2. SICUREZZA: Se è una stringa, azzeriamo il buffer prima del reset
                if (strcmp(self->oggetti[a].tipo, "char") == 0 && self->oggetti[a].Pchar != NULL)
                {
                    memset(self->oggetti[a].Pchar, 0, self->oggetti[a].LcharP);
                }

                // 3. Ripristino
                WebInterface_setValue(self, a, self->oggetti[a].valore_default);

                // 4. Sincronizzazione
                WebInterface_memorizzaDati(self);

                // 5: aggiungi un log anche alla WebInterface se vuoi vederlo sul browser
                WebInterface_Log(self, "SERVER", "Reset: %s ripristinato", nome_var);

                break;
            }
        }
    }
    return httpd_resp_sendstr(req, "OK");
}

// 13 Set Label - Riceve il nome di una variabile e la nuova etichetta da visualizzare
// viene chiamata dal client quando un utente ,modifica l'etichetta di una variabile dalla pagina di configurazione
// per aggiornare dinamicamente l'etichetta sia sulla pagina che su Home Assistant (se HA è attivo)
static esp_err_t setLabel_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;
    char buf[128];
    int ret, remaining = req->content_len;

    if (remaining >= sizeof(buf))
        return ESP_FAIL;

    ret = httpd_req_recv(req, buf, remaining);
    if (ret <= 0)
        return ESP_FAIL;
    buf[ret] = '\0';

    char nome[MAX_NOME] = {0};
    char label[MAX_NOME] = {0};

    // Estraiamo i dati dalla query POST (form-urlencoded)
    // Più semplicemente, visto che usiamo URLSearchParams nel JS:
    httpd_query_key_value(buf, "nome", nome, sizeof(nome));
    httpd_query_key_value(buf, "label", label, sizeof(label));

    // 1. Decodifichiamo i %20 e i simboli (usando la tua funzione esistente)
    url_decode(label);

    // 2. SANITIZZAZIONE: Sostituiamo i caratteri separatori critici
    for (int i = 0; label[i] != '\0'; i++)
    {
        if (label[i] == ':' || label[i] == '|' || label[i] == '=')
        {
            label[i] = '-'; // Sostituiamo con un trattino per sicurezza
        }
    }

    // Cerchiamo l'oggetto e aggiorniamo l'etichetta
    for (int i = 0; i < self->num_oggetti; i++)
    {
        if (strcmp(self->oggetti[i].nome, nome) == 0)
        {
            strncpy(self->oggetti[i].etichetta, label, MAX_NOME - 1);
            WebInterface_Log(self, TAG, "Etichetta aggiornata per %s -> %s", nome, label);

            // Salviamo subito in NVS
            WebInterface_memorizzaDati(self);

            // 2. CONTROLLO HA: Aggiorniamo Home Assistant SOLO se l'oggetto è abilitato
            if (self->oggetti[i].HA == true)
            {
                WebInterface_Log(self, TAG, "Oggetto HA attivo: invio nuovo Discovery per %s", nome);
                WebInterface_publishDiscovery(self, i);
            }
            else
            {
                WebInterface_Log(self, TAG, "Oggetto HA disabilitato: solo aggiornamento locale per %s", nome);
            }

            httpd_resp_sendstr(req, "OK");

            // Opzionale: riavvio per forzare Home Assistant a vedere il cambio
            // WebInterface_resetEsp32(self);
            return ESP_OK;
        }
    }

    httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "Oggetto non trovato");
    return ESP_OK;
}

// 14 Set MQTT - Riceve i parametri di configurazione MQTT (host, port, user, pass) e li salva in NVS
static esp_err_t setMQTT_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;

    char buf[256];
    int ret = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (ret <= 0)
        return ESP_FAIL;
    buf[ret] = '\0';

