MarcoSuma76/sample_projectweb_interface/components/Esp32_WebInterface/Esp32_WebInterface_server_func.c
    char host[MAX_MQTT_SERVER], port_str[10], user[MAX_MQTT_USER], pass[MAX_MQTT_PW];

    httpd_query_key_value(buf, "host", host, sizeof(host));
    httpd_query_key_value(buf, "port", port_str, sizeof(port_str));
    httpd_query_key_value(buf, "user", user, sizeof(user));
    httpd_query_key_value(buf, "pass", pass, sizeof(pass));

    url_decode(host); // Usando la tua funzione url_decode
    url_decode(user);
    url_decode(pass);

    nvs_handle_t h;
    if (nvs_open("storage", NVS_READWRITE, &h) == ESP_OK)
    {
        nvs_set_str(h, "mqtt_host", host);
        nvs_set_i32(h, "mqtt_port", atoi(port_str));
        nvs_set_str(h, "mqtt_user", user);
        nvs_set_str(h, "mqtt_pw", pass);
        nvs_commit(h);
        nvs_close(h);
    }

    // AGGIORNAMENTO DINAMICO:
    if (self->mqtt_enabled)
    {
        WebInterface_Log(self, "MQTT", "Nuovi parametri salvati. Riavvio client...");
        WebInterface_RestartMQTT(self);
    }
    else
    {
        WebInterface_Log(self, "MQTT", "Parametri salvati (MQTT è disabilitato)");
    }

    httpd_resp_sendstr(req, "Parametri salvati. Riavvio...");
    return ESP_OK;
}

// 15 Reset MQTT - Cancella i dati MQTT da NVS e riavvia
static esp_err_t resetMQTT_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;
    nvs_handle_t h;
    if (nvs_open("storage", NVS_READWRITE, &h) == ESP_OK)
    {
        nvs_erase_key(h, "mqtt_host");
        nvs_erase_key(h, "mqtt_port");
        nvs_erase_key(h, "mqtt_user");
        nvs_erase_key(h, "mqtt_pass");
        nvs_commit(h);
        nvs_close(h);
    }
    // AGGIORNAMENTO DINAMICO: se il client è attivo, lo fermiamo e distruggiamo subito per evitare problemi di connessione con dati parziali
    if (self->mqtt_client != NULL)
    {
        esp_mqtt_client_stop(self->mqtt_client);
        esp_mqtt_client_destroy(self->mqtt_client);
        self->mqtt_client = NULL;
        self->mqtt_connected = false;
        WebInterface_Log(self, "MQTT", "Configurazione resettata e client rimosso.");
    }
    httpd_resp_sendstr(req, "MQTT Resettato.");
    return ESP_OK;
}

// 16 Abilita/Disabilita MQTT - Attiva o disattiva il servizio MQTT senza cancellare i dati
static esp_err_t setMqttEnable_handler(httpd_req_t *req)
{
    WebInterface_t *self = (WebInterface_t *)req->user_ctx;
    char buf[32];
    int ret = httpd_req_recv(req, buf, sizeof(buf));
    if (ret <= 0)
        return ESP_FAIL;
    buf[ret] = '\0';

    if (strstr(buf, "enabled=1"))
    {
        self->mqtt_enabled = true;
        // Se il client esiste già, lo facciamo solo ripartire (molto veloce)
        if (self->mqtt_client != NULL)
        {
            esp_mqtt_client_start(self->mqtt_client);
            WebInterface_Log(self, "MQTT", "Servizio ripreso");
        }
        else
        {
            // Se è nullo (es. dopo un reset o primo avvio), usiamo la funzione completa
            WebInterface_StartMQTT(self);
            WebInterface_Log(self, "MQTT", "Servizio avviato");
        }
    }
    else
    {
        self->mqtt_enabled = false;
        // Non distruggiamo il client, lo mettiamo solo in pausa
        if (self->mqtt_client != NULL)
        {
            esp_mqtt_client_stop(self->mqtt_client);
            self->mqtt_connected = false; // Importante per l'icona 🔴 sulla UI
            WebInterface_Log(self, "MQTT", "Servizio sospeso");
        }
    }

    // Ricordati di salvare lo stato in NVS se vuoi che al riavvio l'ESP ricordi ON/OFF
    // WebInterface_SaveSystemConfig(self);

    httpd_resp_send(req, "OK", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

// --- AVVIO DEL SERVER ---
// Questa funzione viene chiamata dal main.c per avviare il server web e registrare tutti gli handler
void WebInterface_Server_Start(WebInterface_t *self)
{
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.stack_size = 8192;     // Più memoria per gestire i JSON
    config.max_uri_handlers = 16; // Più spazio per tutti i tuoi URL

    if (httpd_start(&self->server, &config) == ESP_OK)
    {

        // 1 Handler principale, pagina iniziale
        httpd_uri_t uri_root = {.uri = "/", .method = HTTP_GET, .handler = index_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_root);

        // 2 Handler per ottenere la configurazione iniziale degli oggetti
        httpd_uri_t uri_getOggetti = {.uri = "/getOggettiWeb", .method = HTTP_GET, .handler = getOggettiWeb_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_getOggetti);

        // 3 Handler per ottenere i dati aggiornati (AJAX)
        httpd_uri_t uri_getDati = {.uri = "/getDati", .method = HTTP_GET, .handler = getDati_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_getDati);

        // 4 Handler per ricevere i dati modificati dal web
        httpd_uri_t uri_putDati = {.uri = "/putDati", .method = HTTP_POST, .handler = putDati_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_putDati);

        // 5 Handler per i comandi di sistema (memorizza)
        httpd_uri_t uri_mem = {.uri = "/memorizzaDati", .method = HTTP_POST, .handler = system_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_mem);

        // 6 Handler per i comandi di sistema (azzera dati)
        httpd_uri_t uri_azz = {.uri = "/azzeraDati", .method = HTTP_POST, .handler = system_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_azz);

        // 7 Handler per i comandi di sistema (reset ESP32)
        httpd_uri_t uri_res = {.uri = "/resetEsp32", .method = HTTP_POST, .handler = system_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_res);

        // 8 Handler per la scansione WiFi
        httpd_uri_t uri_scan = {.uri = "/scanWiFi", .method = HTTP_POST, .handler = scanWiFi_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_scan);

        // 9 Handler per la configurazione WiFi (POST)
        httpd_uri_t uri_setup = {.uri = "/setupWiFi", .method = HTTP_POST, .handler = setupWiFi_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_setup);

        // 10 Handler per cancellare i dati WiFi e riavviare
        httpd_uri_t uri_clear_wifi = {.uri = "/clearWiFi", .method = HTTP_POST, .handler = clearWiFi_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_clear_wifi);

        // 11 Handler per OTA
        httpd_uri_t uri_ota = {.uri = "/update", .method = HTTP_POST, .handler = ota_update_post_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_ota);

        // 12 Handler per reset singolo
        httpd_uri_t uri_resetS = {.uri = "/resetSingolo", .method = HTTP_POST, .handler = resetSingolo_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_resetS);

        // 13 Handler per set label
        httpd_uri_t uri_setLabel = {.uri = "/setLabel", .method = HTTP_POST, .handler = setLabel_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_setLabel);

        // 14 Handler per salvare i dati MQTT
        httpd_uri_t setMQTT_uri = {.uri = "/setMQTT", .method = HTTP_POST, .handler = setMQTT_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &setMQTT_uri);

        // 15 Handler per resettare i dati MQTT
        httpd_uri_t resetMQTT_uri = {.uri = "/resetMQTT", .method = HTTP_POST, .handler = resetMQTT_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &resetMQTT_uri);

        // 16 Handler per abilitare/disabilitare MQTT
        httpd_uri_t uri_mqtt_en = {.uri = "/setMqttEnable", .method = HTTP_POST, .handler = setMqttEnable_handler, .user_ctx = self};
        httpd_register_uri_handler(self->server, &uri_mqtt_en);

        ESP_LOGI("WEB_SERVER", "Server Web Online con 16 handler registrati.");

        // --- AGGIUNTE PER DEBUG OTA E VERSIONING ---
        // invio al client la partizione su cui giro(ota1 o ota2)  e data e ora di compilazione del firmware,
        // così da avere un riscontro immediato dopo l'OTA se il nuovo firmware è effettivamente online
        // o se si è verificato qualche errore durante l'aggiornamento
        const esp_partition_t *running = esp_ota_get_running_partition();
        WebInterface_Log(self, "SISTEMA", "Firmware Online (Build: %s %s)", __DATE__, __TIME__);
        WebInterface_Log(self, "SISTEMA", "Partizione attiva: %s", running->label);
        // --------------------------------------------
    }
}